# ScheduleFieldId Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFieldId Class
Members See Also
---
The ScheduleFieldId object is used as a unique identification for a field in a schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ScheduleFieldId
```

Visual Basic
---
```text
Public Class ScheduleFieldId
```

Visual C++
---
```text
public ref class ScheduleFieldId
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ScheduleFieldId
# See Also
ScheduleFieldId Members
Autodesk.Revit.DB Namespace